---
kind: property
id: P:Autodesk.Revit.DB.Visual.Speckle.TextureAngle
source: html/597e6c10-5024-ee17-a0f6-d8796950bdbd.htm
---
# Autodesk.Revit.DB.Visual.Speckle.TextureAngle Property

The property labeled "Angle" from the "Speckle" schema.

## Syntax (C#)
```csharp
public static string TextureAngle { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray3d".